In [1]:
import pandas as pd

In [16]:
df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar',
                          'foo', 'bar'],
                   'B' : ['one', 'one', 'two', 'three',
                          'two', 'two'],
                   'C' : [1, 5, 5, 2, 5, 9],
                   'D' : [2.0, 5., 8., 1., 2., 9.]})

In [17]:
df

     A      B  C    D
0  foo    one  1  2.0
1  bar    one  5  5.0
2  foo    two  5  8.0
3  bar  three  2  1.0
4  foo    two  5  2.0
5  bar    two  9  9.0

In [4]:
grouped = df.groupby('A')

In [20]:
grouped.last()

       B  C    D
A
bar  two  5  9.0
foo  two  5  2.0

In [7]:
grouped['D'].agg([('largest D', lambda x: max(x))])

     largest D
A
bar        9.0
foo        8.0

In [14]:
df.groupby(['A'])['C'].agg([('largest C', lambda x: max(x))])

     largest C
A
bar          5
foo          5

In [18]:
df.groupby('A').C.transform(max)

0    5
1    9
2    5
3    9
4    5
5    9
Name: C, dtype: int64

In [19]:
df[df.C == df.groupby('A').C.transform(max)]

     A    B  C    D
2  foo  two  5  8.0
4  foo  two  5  2.0
5  bar  two  9  9.0

In [60]:
data = {'Sequence':  [1, 2, 4, 6, 7, 9, 10],
        'Value': ["a", "b", "c", "d", "e", "f", "g"]
        }

df = pd.DataFrame (data, columns = ['Sequence','Value'])

In [61]:
df

   Sequence Value
0         1     a
1         2     b
2         4     c
3         6     d
4         7     e
5         9     f
6        10     g

In [62]:
import numpy as np

In [70]:
# df = df.set_index('Sequence').reindex(range(df.Sequence.iat[0],df.Sequence.iat[-1]+1), fill_value=np.NaN).reset_index()
df = df.set_index('Sequence').reindex(range(df.Sequence.iat[0]-1,df.Sequence.iat[-1]+2), fill_value=np.NaN).reset_index()

In [71]:
df

    Sequence Value
0         -1   NaN
1          0     a
2          1     a
3          2     b
4          3     b
5          4     c
6          5     c
7          6     d
8          7     e
9          8     e
10         9     f
11        10     g
12        11     g
13        12   NaN

In [65]:
df.isnull()['Value']

0      True
1     False
2     False
3      True
4     False
5      True
6     False
7     False
8      True
9     False
10    False
11     True
Name: Value, dtype: bool

In [67]:
df = df.fillna(method='ffill')

In [68]:
df = df.fillna(method='bfill')

In [69]:
df

    Sequence Value
0          0     a
1          1     a
2          2     b
3          3     b
4          4     c
5          5     c
6          6     d
7          7     e
8          8     e
9          9     f
10        10     g
11        11     g